app/views/users/index.html.erb

    <%= render user %>
    <% user.microposts.each do |micropost|%>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]

        <%= "Comments" %>
        <% micropost.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 1]]