app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "something"], ["user_id", nil], ["post_id", nil], ["created_at", "2023-11-05 07:19:27.819146"], ["updated_at", "2023-11-05 07:19:27.819146"]]

  def destroy
    @comment.destroy!
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]