app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Abby"], ["email", "abby@mailinator.com"], ["created_at", "2023-11-05 08:38:38.917121"], ["updated_at", "2023-11-05 08:38:38.917121"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user
        if (@user = User.find_by_id(params[:id])).present?
            @user = User.find(params[:id])